/*
Напишите программу, которая на входе принимает два числа и выдаёт, какое число больше, а какое меньше.
*/

// Console.Write("Введите число 1: ");
// int firstNumber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число 2: ");
// int secendNumber = Convert.ToInt32(Console.ReadLine());
// if (firstNumber > secendNumber)
// {
//     Console.WriteLine(firstNumber + " является max");
// }
// else
// {
//     Console.WriteLine(secendNumber + " является max");
// }

/*
Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел
*/
// Console.Write("Введите число 1: ");
// int firstNumber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число 2: ");
// int secendNumber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число 3: ");
// int thirdNumber = Convert.ToInt32(Console.ReadLine());
// int max = firstNumber;
// if (secendNumber > max) max = secendNumber;
// if (thirdNumber > max) max = thirdNumber;
// Console.WriteLine(max + " является max");


/*
Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным
*/
// Console.Write("Введите число N: ");
// int N = Convert.ToInt32(Console.ReadLine());
// if (N % 2 == 0)
// {
//     Console.WriteLine("число чётное");
// }
// else
// {
//     Console.WriteLine("число нечётное");
// }




/*
Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N
*/
// Console.Write("Введите число N: ");
// int N = Convert.ToInt32(Console.ReadLine());
// int number = 1;
// while (number <= N)
// {
//     if (N % 2 == 0)
//     {
//         Console.WriteLine(number + "чётные числа");
//         number ++;
//     }
// }
